Tekla Open API Reference for Tekla Structures 2025
ApplicationFormBase Properties
The ApplicationFormBase type exposes the following members.
Properties
Name | Description
Localization
 The localization instance for the dialog. Each dialog has its own localization instance that has read the localization files needed for that dialog.
 (Inherited from FormBase.)
Top
See Also
Reference
ApplicationFormBase Class
Tekla.Structures.Dialog Namespace